[
  {
    "name": "Refried Bean and Halloumi Tacos",
    "servings": 2,
    "ingredients": [
      {
        "item": "Baby Gem Lettuce",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Plain Taco Tortillas",
        "quantity": 6,
        "unit": "unit(s)"
      },
      {
        "item": "Chipotle Paste",
        "quantity": 20,
        "unit": "grams"
      },
      {
        "item": "Tomato Puree",
        "quantity": 30,
        "unit": "grams"
      },
      {
        "item": "Garlic Clove**",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Black Beans",
        "quantity": 1,
        "unit": "carton(s)"
      },
      {
        "item": "Lime",
        "quantity": 0.5,
        "unit": "unit(s)"
      },
      {
        "item": "Halloumi",
        "quantity": 250,
        "unit": "grams"
      },
      {
        "item": "Mayonnaise",
        "quantity": 2,
        "unit": "sachet(s)"
      },
      {
        "item": "Water",
        "quantity": 100,
        "unit": "milliliter(s)"
      }
    ],
    "method": [
      "Preheat your oven to 180℃. Drain and rinse the black beans in a colander. Pop a third of the beans in a bowl and mash with a fork until broken up. Peel and grate the garlic (or use a garlic press). Zest and halve the lime. Chop the halloumi into 2cm chunks.",
      "Heat a drizzle of oil in a medium saucepan over medium-high heat. Add the garlic and tomato purée, stir and cook for 1 minute. Pour in the water (see ingredients for amount) and add the whole and crushed beans. Mix together and cook for 3-4 mins.",
      "Add half the chipotle paste to the beans. Mix well and season to taste with salt and pepper. Allow to simmer until thickened, 2-3 mins.",
      "Heat a drizzle of oil in a large frying pan on medium-high heat. Add the halloumi and fry until golden, 6-7 mins. Turn every 2 mins. Meanwhile, mix the remaining chipotle paste and half the mayo in a small bowl.",
      "Pop the tacos (3 per person) directly onto the top shelf of the oven until heated through, 1-2 mins. Mix the remaining mayo with the lime zest. Trim the root from the baby gem lettuce then half lengthways. Thinly slice widthways.",
      "Lay the tacos on a board or plate. Spread the chipotle mayo on the base of the tacos. Add a handful of lettuce to the base and squeeze over the lime juice. Add a couple of spoonfuls of the chipotle bean mix to each taco. Top with equal amounts of halloumi cubes, drizzle over the limey mayo. Serve 3 per person with any extra lime wedges for squeezing over. Dig in!"
    ]
  },
  {
    "name": "Creamy Citrus and Courgette Rigatoni",
    "servings": 2,
    "ingredients": [
      {
        "item": "Echalion Shallot",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Garlic Clove**",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Courgette",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Lemon",
        "quantity": 0.5,
        "unit": "unit(s)"
      },
      {
        "item": "Rigatoni Pasta",
        "quantity": 180,
        "unit": "grams"
      },
      {
        "item": "Baby Spinach",
        "quantity": 100,
        "unit": "grams"
      },
      {
        "item": "Creme Fraiche",
        "quantity": 150,
        "unit": "grams"
      },
      {
        "item": "Vegetable Stock Paste",
        "quantity": 10,
        "unit": "grams"
      },
      {
        "item": "Grated Hard Italian Style Cheese",
        "quantity": 40,
        "unit": "grams"
      },
      {
        "item": "Reserved Pasta Water",
        "quantity": 100,
        "unit": "milliliter(s)"
      }
    ],
    "method": [
      "Put a large saucepan of water with 1/2 tsp salt on to boil for the pasta.",
      "Halve, peel and thinly slice the shallot. Peel and grate the garlic (or use a garlic press).",
      "Trim the courgette. Use a peeler to peel long ribbons down the length of the courgette, stopping at the spongy centre.",
      "Zest and halve the lemon (see ingredients for amount).",
      "Once boiling, add the rigatoni to the water and bring back to the boil. Cook until tender, 12 mins.",
      "When ready, reserve some of the pasta water (see pantry for amount), then drain in a colander.",
      "Pop the pasta back into the pan, drizzle with oil and stir through to stop it sticking together.",
      "Meanwhile, heat a drizzle of oil in a large frying pan on medium heat. Once hot, add the courgette ribbons and season with salt and pepper. Cook until softened, 2-3 mins, then stir in the garlic and cook for 1 min more.",
      "Add the spinach a handful at a time and cook until wilted and piping hot, 1-2 mins.Transfer everything to a large bowl and cover to keep warm.",
      "Put your (now empty) frying pan back on medium heat with a drizzle of oil.",
      "Oncethe oil ishot, add the shallot and cook, stirring occasionally, until softened, 4-5 mins. Stir in the veg stock paste and reserved pasta water, then simmer until reduced by half, 3-4 mins.",
      "Mix in the creme fraiche and heat through until piping hot, then season with pepper.",
      "Stir three quarters of the hard Italian style cheese through your creamy sauce.",
      "Add the cooked pasta and half the cooked green veg and stir well to combine. Simmer until everything's piping hot, 1-2 mins.",
      "Add a pinch of lemon zest and a squeeze of lemon juice. Taste and add more salt, pepper and lemon juice if needed. Add a splash of water if it's a little too thick.",
      "Share the creamy pasta between your bowls and top with the remainingcooked green veg.",
      "Finish with a sprinkle of the remaining hard Italian style cheese.",
      "Enjoy!"
    ]
  },
  {
    "name": "Halloumi & Sweet Potato Dal",
    "servings": 2,
    "ingredients": [
      {
        "item": "Sweet Potato",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Onion",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Garlic Clove**",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Korma Curry Paste",
        "quantity": 50,
        "unit": "grams"
      },
      {
        "item": "Vegetable Stock Powder",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Red Split Lentils",
        "quantity": 100,
        "unit": "grams"
      },
      {
        "item": "Halloumi",
        "quantity": 250,
        "unit": "grams"
      },
      {
        "item": "Spring Onion",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Mango Chutney",
        "quantity": 40,
        "unit": "grams"
      },
      {
        "item": "Plain Naans",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Water",
        "quantity": 500,
        "unit": "milliliter(s)"
      }
    ],
    "method": [
      "Preheat your oven to 200°C. Chop the sweet potato into 2cm chunks (no need to peel). Halve, peel and thinly slice the onion. Peel and grate the garlic (or use a garlic press). Pop the sweet potato on a baking tray, drizzle with oil and season with salt and pepper. Toss to coat and spread out in a single layer. Roast in on the top shelf of your oven until golden and tender, 25-30 mins. Turn halfway through cooking.",
      "Heat a drizzle of oil in a large saucepan on medium-heat. Add the onion and cook until soft, stirring occasionally 4-5 mins. Add the korma paste and garlic. Stir together and cook for a minute more. Pour in the water (see ingredients for amount) and vegetable stock powder. Stir to dissolve the stock.",
      "Add the red lentils to your pan, stir and season pepper. Bring to a simmer and cook until they are soft, 20-25 minutes, Stir frequently to make sure they don&#39;t stick to the bottom of the pan! Tip: If the dal is looking a little dry, just add a splash of water.",
      "Meanwhile, cut the halloumi in half through the middle, then cut into 2cm chunks. Trim the spring onion and thinly slice. Heat a drizzle of oil in a frying pan on medium-high heat. Once hot, add the halloumi, fry until golden on all sides, turning often, 3-5 mins total (cook in batches if you need to). Remove the pan from the heat and add the mango chutney. Turn to coat the halloumi in the chutney. Set the pan aside off the heat.",
      "Pop the naans into the oven for the last 3-4 mins of dal cooking time to warm through. Once the sweet potato is roasted, stir it into the dal. Once the dal is cooked, taste and add salt and pepper if you feel it needs it, along with a splash of water if it&#39;s a little dry.",
      "Serve the dal in bowls, warm through the halloumi if necessary and spoon on top of the dal along with a sprinkling of spring onion. Serve with the naan alongside and enjoy!"
    ]
  },
  {
    "name": "Coconut and Lentil Soup",
    "servings": 2,
    "ingredients": [
      {
        "item": "Onion",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Garlic Clove**",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Medium Tomato",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Lentils",
        "quantity": 1,
        "unit": "carton(s)"
      },
      {
        "item": "Lime",
        "quantity": 0.5,
        "unit": "unit(s)"
      },
      {
        "item": "Pasanda Style Seasoning",
        "quantity": 1,
        "unit": "sachet(s)"
      },
      {
        "item": "Coconut Milk",
        "quantity": 200,
        "unit": "milliliter(s)"
      },
      {
        "item": "Vegetable Stock Paste",
        "quantity": 15,
        "unit": "grams"
      },
      {
        "item": "Baby Spinach",
        "quantity": 40,
        "unit": "grams"
      },
      {
        "item": "Plain Naans",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Mango Chutney",
        "quantity": 40,
        "unit": "grams"
      },
      {
        "item": "Water for the Soup",
        "quantity": 200,
        "unit": "milliliter(s)"
      },
      {
        "item": "Butter",
        "quantity": 10,
        "unit": "grams"
      }
    ],
    "method": [
      "If you don't have a toaster, heat your oven to 220°C/200°C fan/gas mark 7 for the naans.",
      "Halve, peel and thinly slice the onion. Peel and grate the garlic (or use a garlic press).",
      "Cut the tomato into 2cm chunks. Drain and rinse the lentils in a sieve.",
      "Zest and halve the lime (see ingredients for amount).",
      "Heat a drizzle of oil in a large saucepan on medium heat.Once hot, fry the onion and cook, stirring frequently, until softened, 5-6 mins.",
      "Add the pasanda style seasoning, lime zest and garlic. Stir-fry for 1 min. Stir in the coconut milk, lentils, veg stock paste and water for the soup (see pantry for amount) until combined.",
      "Bring the soup to the boil, then reduce the heat to low and simmer until slightly thickened, 6-8 mins.",
      "Once thickened,stir through the tomatochunksand spinacha handful at a time until wilted and piping hot, 1-2 mins.",
      "Once the veg has been added to the soup,cut the naans in half widthways, then put in your toaster until golden.",
      "If you're using the oven, put the naans onto a baking tray. Sprinkle with a little water and pop them into the oven to warm through, 2-3 mins.",
      "When toasted, generously spread the butter (see pantry for amount) over the naans.",
      "Once the soup has thickened slightly, stir through the mango chutney and a squeeze of lime juice.",
      "Season to taste with salt, pepper and more lime juice if needed. Remove from the heat.",
      "Share the lentil soup between your bowls.",
      "Serve with the buttery naans alongside.",
      "Enjoy!"
    ]
  },
  {
    "name": "Creamy Mushroom Stroganoff",
    "servings": 2,
    "ingredients": [
      {
        "item": "Basmati Rice",
        "quantity": 150,
        "unit": "grams"
      },
      {
        "item": "Closed Cup Mushrooms",
        "quantity": 375,
        "unit": "grams"
      },
      {
        "item": "Garlic Clove**",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Smoked Paprika",
        "quantity": 1,
        "unit": "sachet(s)"
      },
      {
        "item": "Creme Fraiche",
        "quantity": 75,
        "unit": "milliliter(s)"
      },
      {
        "item": "Vegetable Stock Paste",
        "quantity": 10,
        "unit": "grams"
      },
      {
        "item": "Flat Leaf Parsley",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Dijon Mustard",
        "quantity": 10,
        "unit": "grams"
      },
      {
        "item": "Worcester Sauce",
        "quantity": 22,
        "unit": "milliliter(s)"
      },
      {
        "item": "Baby Spinach",
        "quantity": 100,
        "unit": "grams"
      },
      {
        "item": "Water for the Sauce",
        "quantity": 100,
        "unit": "milliliter(s)"
      }
    ],
    "method": [
      "a) Boil a full kettle.b) When boiling, pour into a large saucepan with 1/4 tsp salt on high heat. Add the rice and cook for 10-12 mins.c) Drain in a sieve and pop back in the pan. Cover with a lid and leave to the side until ready to serve.",
      "a) Quarter the mushrooms.b) Peel and grate the garlic (or use a garlic press).c) Heat a drizzle of oil in a large frying pan on high heat.d) Once hot, add the mushrooms to the pan and season with salt and pepper. Cook until browned, 5-6 mins, stirring occasionally.",
      "a) Turn down the heat slightly to medium-high, then add the garlic and smoked paprika to the pan. Stir-fry until fragrant, 30 secs.b) Stir in the water for the sauce (see ingredients for amount) and vegetable stock paste.c) Reserve a couple of tablespoons of creme fraiche in a small bowl, then stir the remaining creme fraiche into the mushrooms.d) Bring to the boil, then lower the heat and simmer until thickened, 4-5 mins.",
      "a) In the meantime, roughly chop the parsley.",
      "a) Once the sauce has thickened, stir in the Dijon mustard and Worcester sauce.b) Add the spinach to the pan a handful at a time until wilted and piping hot, 1-2 mins.c) Taste and season with salt and pepper. TIP: Add a splash of water if it's a little thick.d) Stir in half the parsley, then remove from the heat."
    ]
  },
  {
    "name": "Cheesy Chipotle Bean Quesadillas",
    "servings": 2,
    "ingredients": [
      {
        "item": "Mixed Beans",
        "quantity": 1,
        "unit": "carton(s)"
      },
      {
        "item": "Spring Onion",
        "quantity": 2,
        "unit": "unit(s)"
      },
      {
        "item": "Mature Cheddar Cheese",
        "quantity": 60,
        "unit": "grams"
      },
      {
        "item": "Chipotle Paste",
        "quantity": 20,
        "unit": "grams"
      },
      {
        "item": "Tomato Puree",
        "quantity": 30,
        "unit": "grams"
      },
      {
        "item": "Super Soft Tortillas with Whole Wheat",
        "quantity": 4,
        "unit": "unit(s)"
      },
      {
        "item": "Avocado",
        "quantity": 1,
        "unit": "unit(s)"
      },
      {
        "item": "Baby Plum Tomatoes",
        "quantity": 125,
        "unit": "grams"
      },
      {
        "item": "Balsamic Vinegar",
        "quantity": 12,
        "unit": "milliliter(s)"
      },
      {
        "item": "Wild Rocket",
        "quantity": 40,
        "unit": "grams"
      },
      {
        "item": "Olive Oil for the Dressing",
        "quantity": 1,
        "unit": "sachet(s)"
      }
    ],
    "method": [
      "Drain and rinse the mixed beans. Pop into a bowl and roughly mash with the back of a fork or a potato masher.Trim the spring onions then slice thinly. Grate the cheddar cheese. Add the spring onion, cheese, chipotle paste and tomato puree to the beans.Season with salt, pepper and a pinch of sugar. Mix well.",
      "Lay the tortillas out on a board.Spread a little of the bean mix over half of each, leaving a small border round the edge, then fold the tortillas in half to make half moon shapes.Heat a drizzle of oil in a large frying pan on medium-high heat.",
      "When hot, carefully lay the quesadillas in the pan. Fry until golden, 2 mins each side. Turn carefully.Lightly press down on the tortillas with a spatula to ensure they stick together and brown nicely.TIP: You may have to do this in batches, adding a little more oil to the pan each time - just cover the cooked quesadillas with foil to keep warm.",
      "While the quesadillas are frying, slice lengthways into the avocado. Once you reach the stone turn the avocado around to cut it in half. Twist each half and pull it apart. Remove the stone then scoop out the insides onto a board. Roughly chop the avocado.Halve the tomatoes.",
      "In a large bowl, combine the balsamic vinegar with the olive oil (see ingredients for amount).Season with salt and pepper.Add the rocket, tomatoes and avocado and toss gently.",
      "Serve the quesadillas alongside plenty of rocket salad.Enjoy!"
    ]
  }
]